configuration/src/Catalogs/ЭтапыКанбана/ЭтапыКанбана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭтапыКанбана</name>
  <owners>Catalog.Филиалы</owners>
  <owners>Catalog.Процессы</owners>
  <attributes>
    <name>ПорядокОтображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКанбана</name>
    <type>
      <types>EnumRef.ТипыКанбана</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьМаксимальноеКоличествоЗадач</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьМинимальноеКоличествоЗадач</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Переходы</name>
    <attributes>
      <name>ЭлементПерехода</name>
      <type>
        <types>CatalogRef.ЭтапыКанбана</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьВидыИсполнителей</name>
    <attributes>
      <name>ВидИсполнителя</name>
      <type>
        <types>EnumRef.ПринадлежностьИсполнителейКЗадаче</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыЭтапа</name>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.ВидыЗадач</types>
        <types>CatalogRef.СтатусыОбъектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Enums/ТипыКанбана/ТипыКанбана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКанбана</name>
  <enumValues>
    <name>ЗадачаНовый</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаРазработку</name>
  </enumValues>
  <enumValues>
    <name>Проекты</name>
  </enumValues>
  <enumValues>
    <name>Кастомный</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееЗаданиеНовый</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкиМоегоФилиала</name>
  </enumValues>
  <enumValues>
    <name>ПулЗаявокНовый</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Documents/Спринт/Спринт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Спринт</name>
  <comment>Документ для фиксации спринта по методологии Agile</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпринта</name>
    <type>
      <types>EnumRef.ВидыСпринта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Спринт</types>
    </type>
  </attributes>
  <attributes>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Направления</name>
    <attributes>
      <name>Направление</name>
      <type>
        <types>CatalogRef.НаправленияРазработки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

configuration/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <basedOn>Catalog.Проекты</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроекта</name>
    <type>
      <types>CatalogRef.ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>EnumRef.ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <comment>Дата создания</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГотовностиКМаштабированию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПодготовки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазработки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРассмотрения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереходаВТестирование</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлановоеНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлановоеОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзмененияПодчиненных</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <comment>Заказчик проекта</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортированаИзRedmine</name>
    <comment>Признак того, что этот проект является импортированной задачей Redmine</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексируемоеОписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КороткийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КороткоеНазвание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиRedmine</name>
    <comment>Номер импортированной задачи Redmine</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОснование</name>
    <comment>Ссылка на другой объект БД, которому подчинен текущий объект</comment>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Продукты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения</name>
    <comment>Процент выполнения с шагом 10</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФинансовыеЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/Catalogs/Продукты/Продукты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Продукты</name>
  <attributes>
    <name>ВидОчереди</name>
    <type>
      <types>EnumRef.ВидыОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Системы</name>
    <attributes>
      <name>Система</name>
      <comment>система, которую затрагивает продукт</comment>
      <type>
        <types>CatalogRef.СистемыУчета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/ГруппыЗаказчиковНаправлений/ГруппыЗаказчиковНаправлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыЗаказчиковНаправлений</name>
  <predefined>
    <items>
      <name>ПрочиеЗаказчики</name>
      <description>Прочие заказчики</description>
    </items>
  </predefined>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОтветственных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФилиалIT</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказчики</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Направления</name>
    <attributes>
      <name>Направление</name>
      <type>
        <types>CatalogRef.НаправленияРазработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Системы</name>
    <attributes>
      <name>Система</name>
      <type>
        <types>CatalogRef.СистемыУчета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/ЭтапыКанбана/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует структуру настроек для отображения прочих отборов в НастройкиИнструментов.
//
// Параметры:
//  Параметры - ДанныеФормыСтруктура - Параметры формы
// 
// Возвращаемое значение:
//   Структура  - настройки для прочих отборов. 
//
Функция ПолучитьНастройкуПрочихОтборов(Параметры) Экспорт
	
	ТипКанбана = Параметры.ТипКанбана;
	
	ПользовательПустаяСсылка = Справочники.Пользователи.ПустаяСсылка();
	ТегПустаяСсылка = Справочники.Теги.ПустаяСсылка();
	ПроектПустаяСсылка = Справочники.Проекты.ПустаяСсылка();
	ПродуктПустаяСсылка = Справочники.Продукты.ПустаяСсылка();
	СистемаПустаяСсылка = Справочники.СистемыУчета.ПустаяСсылка();
	НаправлениеПустаяСсылка = Справочники.НаправленияРазработки.ПустаяСсылка();
	ФилиалПустаяСсылка = Справочники.Филиалы.ПустаяСсылка();
	НазначениеПустаяСсылка = Справочники.НазначенияЗадач.ПустаяСсылка();
	СпринтПустаяСсылка = Документы.Спринт.ПустаяСсылка();
	ГруппаЗаказчиковПустаяСсылка = Справочники.ГруппыЗаказчиковНаправлений.ПустаяСсылка();
	
	НастройкиПрочиеОтборы = Новый Структура;
	
	Если ТипКанбана = Перечисления.ТипыКанбана.ВнутреннееЗаданиеНовый Тогда 
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Автор", ПользовательПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "ДатаИзменения", Новый СтандартнаяДатаНачала, "Дата изменения");
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Назначение", НазначениеПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Направление", НаправлениеПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Проект", ПроектПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Спринт", СпринтПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Тег", ТегПустаяСсылка);		
		
	ИначеЕсли ТипКанбана = Перечисления.ТипыКанбана.ЗаявкиМоегоФилиала Тогда
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Автор", ПользовательПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "ГруппаЗаказчиков", ГруппаЗаказчиковПустаяСсылка, "Группа заказчиков");	
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Назначение", НазначениеПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Направление", НаправлениеПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Продукт", ПродуктПустаяСсылка);  
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Проект", ПроектПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "СистемаУчета", СистемаПустаяСсылка, "Система учета");
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Спринт", СпринтПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Тег", ТегПустаяСсылка);

	ИначеЕсли ТипКанбана = Перечисления.ТипыКанбана.ПулЗаявокНовый Тогда
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Автор", ПользовательПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Назначение", НазначениеПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Проект", ПроектПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Спринт", СпринтПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Тег", ТегПустаяСсылка);
			
	Иначе
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Автор", ПользовательПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "ДатаИзменения", Новый СтандартнаяДатаНачала, "Дата изменения");
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "ГруппаЗаказчиков", ГруппаЗаказчиковПустаяСсылка, "Группа заказчиков");
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Команда", ФилиалПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Назначение", НазначениеПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Направление", НаправлениеПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Продукт", ПродуктПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Проект", ПроектПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "СистемаУчета", СистемаПустаяСсылка, "Система учета");
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Спринт", СпринтПустаяСсылка);
		ВставитьНастройкуПоУмолчанию(НастройкиПрочиеОтборы, "Тег", ТегПустаяСсылка);
		
	КонецЕсли;
	
	Возврат НастройкиПрочиеОтборы;
	
КонецФункции

#КонецОбласти

#Область Служебные

Процедура ВставитьНастройкуПоУмолчанию(Настройки, Ключ, ЗначениеПоУмолчанию, Представление = Неопределено) 
	
	Настройка = Новый Структура;
	Настройка.Вставить("ПоУмолчанию", ЗначениеПоУмолчанию); 
	
	Если Представление <> Неопределено Тогда
		Настройка.Вставить("Представление", Представление); 
	КонецЕсли;
	
	Настройки.Вставить(Ключ, Настройка);
	
КонецПроцедуры
	
#КонецОбласти
